controllers/ReceitaController.php

INSERT INTO `receita` (`nome`) VALUES ('Ovo Frito')
INSERT INTO `receita_ingrediente` (`receita_id`, `ingrediente_id`, `quantidade`) VALUES (6, 1, 1)
SELECT EXISTS(SELECT * FROM `ingrediente` WHERE `ingrediente`.`id`='1')
SELECT EXISTS(SELECT * FROM `receita` WHERE `receita`.`id`=6)
SELECT * FROM `ingrediente`
---
    public function actionCreate()
    {
        $receita = new Receita();
        $ingredientesSelecionados = [];
        $quantidades = [];
        if ($receita->load(Yii::$app->request->post()) && $receita->save()) {

            $ingredientesSelecionados = Yii::$app->request->post('ingredientes');
            $quantidades = Yii::$app->request->post('quantidade');

            if (!empty($ingredientesSelecionados)) {
                foreach ($ingredientesSelecionados as $ingredienteId) {
                    $receitaIngrediente = new ReceitaIngrediente();
                    $receitaIngrediente->receita_id = $receita->id;
                    $receitaIngrediente->ingrediente_id = $ingredienteId;
                    $receitaIngrediente->quantidade = $quantidades[$ingredienteId];
                    $receitaIngrediente->save();
                }
            }

            Yii::$app->session->setFlash('success', 'Receita e ingredientes adicionados com sucesso!');
            return $this->redirect(['index']);
        }

        return $this->render('create', [
            'receita' => $receita,
            'ingredientes' => Ingrediente::find()->all(),
            'ingredientesSelecionados' => $ingredientesSelecionados,
            'quantidades' => $quantidades,
        ]);

SELECT * FROM `receita`
---
    public function actionReceitasComIngredientesSuficientes()
    {
        $receitas = Receita::find()->all();

SELECT * FROM `receita` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Receita::findOne(['id' => $id])) !== null) {