models/Receita.php

SELECT * FROM `receita_ingrediente` WHERE (`receita_id`=2) AND (`ingrediente_id`=1)
---
    public function getQuantidadeParaIngrediente($ingredienteId)
    {
        $receitaIngrediente = ReceitaIngrediente::findOne(['receita_id' => $this->id, 'ingrediente_id' => $ingredienteId]);